// Написати програму де компютер загадає число від 1 до 10 і
// запропонує користувачу вгадати його Користувач вводить свій
// варіант і отримує результат (Виграв чи ні) Вивести результат в
// форматі "Вітаю ви вгадали число (тут варіант компютера)" або "Ви
// програли, компютер загадав (тут варіант компютера)"

let compNumb = Math.round(Math.random()*10);
let userNumb = prompt('Введите число от 1 до 10');
let message;

if(userNumb){
if(userNumb*1 % 1 == 0){
if(userNumb <= 10){
if(compNumb == userNumb){
message = `Вітаю ви вгадали число ${compNumb}`
} else { message = `Ви програли, компютер загадав ${compNumb}`}
} else { message = 'чисо більше 10'}
} else { message = 'невірний формат'}
} else { message = 'Отменено пользователем!'};

alert(message)
