// Написати ф-ю median яка приймає масив і знаходить
// його медіану Медіана – це числове значення, яке ділить
// відсортований масив чисел на більшу і меншу половини. У
// відсортованому масиві з непарним числом елементів медіана – це
// число в середині масиву. Для масиву з парним числом елементів, де
// нема ні одного елемента точно посередині, медіана – це середнє
// значення двох чисел, які знаходяться в середині масиву. В цій
// задачі заданий непустий масив натуральних чисел. Вам потрібно
// знайти медіану даного масиву.

// median([1, 2, 3, 4, 5]) // 3

// median([3, 6, 10, 15, 20, 99]) // 12.5

let median = (arr) => {
    let a = arr.length;
    let b = 0;
    
    a % 2 == 0 ? b = (arr[a/2-1] + arr[a/2 ]) / 2 : b = arr[(a-1)/2]
        //console.log(b);
    return b;
}

median([1, 2, 3, 4, 5])
median([3, 6, 10, 15, 20, 99])